<template>
  <!-- 这个页面应该包括一个头部和尾部 然后中间是一个插座 -->
  <div class="container">
    <!-- 这是头部内容 -->
    <header>猫眼电影</header>

    <!-- 这是中间的内容main是用来占位的布局 里面也需要拆变成 所以变成一个插座 -->
    <div class="main">
      <!-- 这里就是显示home里面下的三个子路由 默认建议是显示movies子路由的 -->
      <router-view></router-view>
    </div>

    <!-- vant修改footer 这是footer的内容  -->
    <van-tabbar
      v-model="active"
      :fixed="false"
      active-color="#cc4c43"
      inactive-color="#000"
      route
    >
      <!-- 在vant中 to代表你要跳转的路由  需要在van-tabbar-item里面加-->
      <van-tabbar-item to="/movie/inTheaters">
        <svg
          width="25"
          height="25"
          viewBox="0 0 50 50"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g fill="#696969" fill-rule="evenodd">
            <path
              d="M24.994 47c-.71 0-1.422-.034-2.136-.102C12.445 45.913 4.14 37.645 3.11 27.24c-.657-6.63 1.65-13.115 6.332-17.796 4.68-4.68 11.162-6.992 17.796-6.333 10.36 1.027 18.624 9.29 19.65 19.65.592 5.984-1.192 11.796-5.022 16.365-.162.193-.158.463.007.63l3.425 3.424c.586.584.586 1.534 0 2.12-.586.586-1.535.586-2.12 0l-3.426-3.425c-1.274-1.273-1.353-3.284-.185-4.677 3.307-3.946 4.847-8.97 4.335-14.142-.886-8.942-8.018-16.074-16.96-16.96-5.732-.562-11.336 1.426-15.38 5.47-4.042 4.042-6.034 9.647-5.467 15.378.89 8.98 8.058 16.117 17.045 16.968 3.867.37 7.68-.417 11.03-2.267.725-.4 1.637-.138 2.037.588.4.725.137 1.638-.588 2.038-3.26 1.8-6.896 2.73-10.626 2.73"
            ></path>
            <path
              d="M28 16c0 1.657-1.343 3-3 3s-3-1.343-3-3 1.343-3 3-3 3 1.343 3 3M28 34c0 1.657-1.343 3-3 3s-3-1.343-3-3 1.343-3 3-3 3 1.343 3 3M34 28c-1.657 0-3-1.343-3-3s1.343-3 3-3 3 1.343 3 3-1.343 3-3 3M16 28c-1.657
               0-3-1.343-3-3s1.343-3 3-3 3 1.343 3 3-1.343 3-3 3"
            ></path>
          </g>
        </svg>
        <span>电影</span>
      </van-tabbar-item>
      <van-tabbar-item to="/theaters/">
        <i class="yo-ico">&#xe8c0;</i>
        <span>影院</span>
      </van-tabbar-item>

      <van-tabbar-item to="/profile">
        <svg
          width="25"
          height="25"
          viewBox="0 0 50 50"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g fill="#696969" fill-rule="evenodd">
            <path
              d="M19.916 35.913c-.014-.016-.02-.036-.033-.05-.314-.32-.737-.455-1.153-.432C13.586 33.066 10 27.9 10 21.908 10 13.687 16.728 7 25 7c8.27 0 15 6.687 15 14.907 0 8.22-6.73 14.906-15 14.906-1.787 0-3.493-.328-5.084-.9zm14.502 1.225C39.558 33.98 43 28.343 43 21.908 43 12.032 34.925 4 25 4S7 12.033 7 21.907c0 6.657 3.68 12.466 9.113 15.552l-6.086 5.97c-.59.58-.6 1.53-.02 2.12.294.3.682.45 1.07.45.38 0 .76-.143 1.052-.43l6.916-6.785c1.867.654 3.865 1.028 5.954 1.028 2.324 0 4.54-.455 6.58-1.256l7.15 7.014c.292.287.672.43 1.05.43.39 0 .78-.15 1.072-.45.58-.59.57-1.54-.02-2.12l-6.414-6.292z"
            ></path>
            <path
              d="M30.358 25.068c-.77-.31-1.642.064-1.95.832-.554 1.375-1.89 2.263-3.408 2.263-1.503 0-2.835-.877-3.395-2.234-.316-.766-1.19-1.13-1.96-.815-.765.316-1.13 1.193-.813 1.96 1.024 2.483 3.446 4.088 6.168 4.088 2.75 0 5.178-1.627 6.19-4.144.31-.77-.063-1.643-.832-1.952"
            ></path>
          </g>
        </svg>
        <span>我的</span>
      </van-tabbar-item>
    </van-tabbar>
    <!-- 底部tab -->
    <!-- <footer>
      <ul>
        <li class="active">
          <svg
            width="25"
            height="25"
            viewBox="0 0 50 50"
            xmlns="http://www.w3.org/2000/svg"
          >
            <g fill="#696969" fill-rule="evenodd">
              <path
                d="M24.994 47c-.71 0-1.422-.034-2.136-.102C12.445 45.913 4.14 37.645 3.11 27.24c-.657-6.63 1.65-13.115 6.332-17.796 4.68-4.68 11.162-6.992 17.796-6.333 10.36 1.027 18.624 9.29 19.65 19.65.592 5.984-1.192 11.796-5.022 16.365-.162.193-.158.463.007.63l3.425 3.424c.586.584.586 1.534 0 2.12-.586.586-1.535.586-2.12 0l-3.426-3.425c-1.274-1.273-1.353-3.284-.185-4.677 3.307-3.946 4.847-8.97 4.335-14.142-.886-8.942-8.018-16.074-16.96-16.96-5.732-.562-11.336 1.426-15.38 5.47-4.042 4.042-6.034 9.647-5.467 15.378.89 8.98 8.058 16.117 17.045 16.968 3.867.37 7.68-.417 11.03-2.267.725-.4 1.637-.138 2.037.588.4.725.137 1.638-.588 2.038-3.26 1.8-6.896 2.73-10.626 2.73"
              ></path>
              <path
                d="M28 16c0 1.657-1.343 3-3 3s-3-1.343-3-3 1.343-3 3-3 3 1.343 3 3M28 34c0 1.657-1.343 3-3 3s-3-1.343-3-3 1.343-3 3-3 3 1.343 3 3M34 28c-1.657 0-3-1.343-3-3s1.343-3 3-3 3 1.343 3 3-1.343 3-3 3M16 28c-1.657
               0-3-1.343-3-3s1.343-3 3-3 3 1.343 3 3-1.343 3-3 3"
              ></path>
            </g>
          </svg>
          <span>电影</span>
        </li>
        <li>
          <i class="yo-ico">&#xe8c0;</i>
          <span>影院</span>
        </li>
        <li>
          <svg
            width="25"
            height="25"
            viewBox="0 0 50 50"
            xmlns="http://www.w3.org/2000/svg"
          >
            <g fill="#696969" fill-rule="evenodd">
              <path
                d="M19.916 35.913c-.014-.016-.02-.036-.033-.05-.314-.32-.737-.455-1.153-.432C13.586 33.066 10 27.9 10 21.908 10 13.687 16.728 7 25 7c8.27 0 15 6.687 15 14.907 0 8.22-6.73 14.906-15 14.906-1.787 0-3.493-.328-5.084-.9zm14.502 1.225C39.558 33.98 43 28.343 43 21.908 43 12.032 34.925 4 25 4S7 12.033 7 21.907c0 6.657 3.68 12.466 9.113 15.552l-6.086 5.97c-.59.58-.6 1.53-.02 2.12.294.3.682.45 1.07.45.38 0 .76-.143 1.052-.43l6.916-6.785c1.867.654 3.865 1.028 5.954 1.028 2.324 0 4.54-.455 6.58-1.256l7.15 7.014c.292.287.672.43 1.05.43.39 0 .78-.15 1.072-.45.58-.59.57-1.54-.02-2.12l-6.414-6.292z"
              ></path>
              <path
                d="M30.358 25.068c-.77-.31-1.642.064-1.95.832-.554 1.375-1.89 2.263-3.408 2.263-1.503 0-2.835-.877-3.395-2.234-.316-.766-1.19-1.13-1.96-.815-.765.316-1.13 1.193-.813 1.96 1.024 2.483 3.446 4.088 6.168 4.088 2.75 0 5.178-1.627 6.19-4.144.31-.77-.063-1.643-.832-1.952"
              ></path>
            </g>
          </svg>
          <span>我的</span>
        </li>
      </ul>
    </footer> -->
  </div>
</template>

<script>
//导入vue 和vant组件库中 使用其切换功能需要的插件
import Vue from 'vue'
import { Tabbar, TabbarItem } from 'vant'
Vue.use(Tabbar)
Vue.use(TabbarItem)

export default {
  data() {
    return {
      active: 0, //	是否处于点击状态
    }
  },

  methods: {},

  created() {},
}
</script>



<!-- 定义的样式 -->
<style lang="stylus" scoped>
// stylus下需要用波浪线
@import '~@a/stylus/border.styl'
@import '~@a/stylus/ellipsis.styl'
.container // 整体布局
  height 100%
  display flex
  flex-direction column
header // 头部样式
  height 0.44rem
  background #cc4c43
  line-height 0.44rem
  text-align center
  font-size 0.16rem
  font-weight bold
  color #fff
.main // 定义的是main的样式 中间部分的
  overflow-y scroll
  flex 1
  footer // 定义的是底部的样式
    height 0.5rem
    ul
      border_1px(1px 0 0 0)
      height 100%
      display flex
    li
      padding-top 0.04rem
      flex 1
      display flex
      flex-direction column
      justify-content center
      align-items center
      font-size 0.2rem
      color #666
      i
        font-size 0.24rem
        line-height 0.25rem
      span
        font-size 0.15rem
        transform scale(0.8)
      &.active
        color #cc4c43
        svg
          g
            fill #cc4c43
.pre-show, .version
  background-size contain
  background-repeat no-repeat
  height 14px
  width 17px
  display inline-block
  margin-top 5px
  -webkit-box-flex 0
  flex 0 0 auto
  margin-right 3px
</style>

<!-- 这里是覆盖vant组件的样式特殊情况 -->

<style lang="stylus">
.van-tabbar-item__text
  display flex
  flex-direction column
svg
  margin-bottom 0.02rem
i
  font-size 0.24rem
  line-height 0.25rem
.van-tabbar-item--active
  svg
    g
      fill #cc4c43
      margin-bottom 0.04rem
</style>